Autodesk.Revit.DB.Structure.AnalyticalAutomationClientManager.RegisterExtModelCallback(Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallback)
Set the external model callback.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.1

Autodesk.Revit.DB.Structure.AnalyticalAutomationClientManager.GetModelCallback
Get the current external model callback.
Since:
2026.1

Autodesk.Revit.DB.Structure.AnalyticalAutomationClientManager.GetInstance
Get a reference to the AnalyticalAutomationClientManager singleton.
Since:
2026.1

Autodesk.Revit.DB.Structure.AnalyticalAutomationClientManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalAutomationClientManager
class that manages relation to external models
Since:
2026.1